In [1]:
import pandas as pd

In [2]:
d = ['a','b','c','d','e']
idd = [1,2,3,4,5]
dic = {1:'a',2:'b',3:'c',4:'d',5:'e'}

In [3]:
pd.Series(data=d,index=idd)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [4]:
pd.Series(dic)

1    a
2    b
3    c
4    d
5    e
dtype: object

In [6]:
a = [1,2,3,4,5]
b = [1,2,3,4,5]
c = [1,2,3,4,5]
d = [1,2,3,4,5]
e = [1,2,3,4,5]
col = ['A','B','C','D','E']

df = pd.DataFrame([a,b,c,d,e],idd,col)

In [7]:
df

   A  B  C  D  E
1  1  2  3  4  5
2  1  2  3  4  5
3  1  2  3  4  5
4  1  2  3  4  5
5  1  2  3  4  5

In [8]:
df['F'] = df['A']+df['B']

In [9]:
df

   A  B  C  D  E  F
1  1  2  3  4  5  3
2  1  2  3  4  5  3
3  1  2  3  4  5  3
4  1  2  3  4  5  3
5  1  2  3  4  5  3

In [11]:
df.drop(5,inplace=True)

In [12]:
df

   A  B  C  D  E  F
1  1  2  3  4  5  3
2  1  2  3  4  5  3
3  1  2  3  4  5  3
4  1  2  3  4  5  3

In [13]:
df.drop('F',axis=1)

   A  B  C  D  E
1  1  2  3  4  5
2  1  2  3  4  5
3  1  2  3  4  5
4  1  2  3  4  5

In [14]:
df['A']      ## access cols

1    1
2    1
3    1
4    1
Name: A, dtype: int64

In [17]:
df.loc[1]   ## access rows

A    1
B    2
C    3
D    4
E    5
F    3
Name: 1, dtype: int64

In [19]:
df.loc[2,'B']     ## access with row , col

2

In [20]:
df[df>3]

    A   B   C  D  E   F
1 NaN NaN NaN  4  5 NaN
2 NaN NaN NaN  4  5 NaN
3 NaN NaN NaN  4  5 NaN
4 NaN NaN NaN  4  5 NaN

   A  B  C  D  E  F
1  1  2  3  4  5  3
2  1  2  3  4  5  3
3  1  2  3  4  5  3
4  1  2  3  4  5  3